#!/bin/bash
echo "--- Звіт про стан системи від $(date) ---"

echo -e "\n[1] Вільні місця на диску:"
df -h | grep '^/dev/'

echo -e "\n[2] Топ-5 процесів (RAM):"
ps aux --sort=%mem |awk 'NR<=6 {print $1, $2, $3, $4, $11}'

echo -e "\n[3] Статус порту 80:"
if ss -tulpn | grep -q ":80"; then
      echo "✅ Порт 80 прослуховується."
else
      echo "❌ Порт 80 ВІДКРИТИЙ АБО СЕРВІС НЕ ЗАПУЩЕНИЙ!"
fi

echo -e "\n[4] Всього оперативної пам'яті (RAM) зараз вільно"
free -h

echo -e "\n--- Кінець звіту ---"
