#Використовуючи функцію, напишіть програму на Python. Функція має приймати дані від користувача. Програма повинна генерувати випадкове число від 1 #до 100 і зберігати його в змінній. Користувачеві пропонується вгадати число. Якщо припущення користувача правильне, програма повинна надрукувати #«Вітаємо! Ви вгадали правильне число». і вихід. Якщо припущення користувача неправильне, програма має надати зворотний зв’язок, як-от «Занадто #високо» або «Занадто низько», і дозволити користувачеві вгадати ще раз. Користувач повинен мати максимум 5 спроб, щоб вгадати правильне число. #Після 5 невдалих спроб програма повинна надрукувати «Вибачте, у вас закінчилися спроби. Правильний номер був [правильний номер]» і вийти.

#import lib
import random

#func quiz
def guess_the_number():
  print("=== Вікторина вгадай щасливе число ===")
  #random num in var
  num_random = random.randrange(1, 101)
  #var with attempts
  attempts = 5
  
  #cycle for count attempts 
  for i in range(1, attempts + 1):
    enter_user = int(input("Введіть Ваше число: "))
    
    #comparing numbers
    if num_random == enter_user:
      print("Вітаємо! Ви вгадали правильне число")
      return
    elif num_random > enter_user:
      print("Занадто низько")
    else:
      print("Занадто високо")

  #If user try all apptemps, print this hint
  print(f"Вибачте, у вас закінчилися спроби. Правильним числом було {num_random}")

guess_the_number()
